// 전개연산자 296p
// 얕은 복사 : 객체의 참조값(주소 값)을 복사한다
// 깊은 복사 : 객체의 실제 값을 복사한다

// 참조값(주소값)을 복사한다?
// 노션javascript = 항해주차활동 - 발표


// 얕은복사
const 물건_200301 = ['우유','식빵']
const 물건_200302 = 물건_200301
// 물건_200302.push('고구마')
// 물건_200302.push('토마토')

console.log(물건_200301 === 물건_200302)
console.log(`물건1 : ${물건_200301}`) //[ '우유', '식빵', '고구마', '토마토' ]
console.log(`물건2 : ${물건_200302}`) //[ '우유', '식빵', '고구마', '토마토' ]


// 전개연산자
const 물건_200303 = ['우유','식빵']
const 물건_200304 = [...물건_200301]

console.log(`물건4 : ${물건_200304}`)
console.log(`전개연산자 ${물건_200303 === 물건_200304}`)

// 물건_200304.push('고구마')
// console.log(`물건3 : ${물건_200303}`)
// console.log(`물건4 : ${물건_200304}`)

